Revit 2026 API

# WorksharingDisplaySettingsRemoveUsers Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveUsers(
	Document document,
	ICollection<string> usersToRemove,
	out ICollection<string> usersActuallyRemoved
)
```
```vb
Public Sub RemoveUsers (
	document As Document,
	usersToRemove As ICollection(Of String),
	<OutAttribute> ByRef usersActuallyRemoved As ICollection(Of String)
)
```
```cpp
public:
void RemoveUsers(
	Document^ document,
	ICollection<String^>^ usersToRemove,
	[OutAttribute] ICollection<String^>^% usersActuallyRemoved
)
```
```fsharp
member RemoveUsers :
        document : Document *
        usersToRemove : ICollection<string> *
        usersActuallyRemoved : ICollection<string> byref -> unit
```

#### Parameters

document Document

usersToRemove ICollectionString

usersActuallyRemoved ICollectionString

#### Reference

WorksharingDisplaySettings Class

Autodesk.Revit.DB Namespace